Code/app/views/users/show.html.haml

        = f.submit "Tag User"
      - photo.tags.each do |tag|
---
SELECT "tags".* FROM "tags" WHERE "tags"."photo_id" = ?  [["photo_id", 2]]