Code/app/views/users/show.html.haml

SELECT "users".* FROM "users"
---
        - if current_user != user
          - if current_user.followed_users.include?(user)

SELECT  1 AS one FROM "comments" WHERE "comments"."photo_id" = ? LIMIT 1  [["photo_id", 4]]
SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = ?  ORDER BY "comments"."created_at" DESC  [["photo_id", 15]]
---
        %h3 Comments:
        - if photo.comments.any?

SELECT  "photos".* FROM "photos" WHERE "photos"."user_id" = ?  ORDER BY "photos"."created_at" DESC LIMIT 1  [["user_id", 2]]
---
    .row
      - followed_user.photos.order(created_at: :desc).each_with_index do |photo, index|
        .col-sm-4
          .slideshow-container{ data: { "slide-index" => index } }