Code/app/controllers/comments_controller.rb

  def create
    @photo = Photo.find(params[:photo_id])
    @comment = @photo.comments.new(comment_params)
    @comment.user = current_user

    if @comment.save
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("text", "photo_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["text", "WOAH"], ["photo_id", 1], ["user_id", 1], ["created_at", "2024-11-22 21:15:20.214837"], ["updated_at", "2024-11-22 21:15:20.214837"]]

  def destroy
    @comment = Comment.find(params[:id])
    @photo = @comment.photo

    if current_user == @comment.user || current_user == @photo.user
      @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]