Code/app/controllers/photos_controller.rb

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 1]]
---
    def destroy
      @photo = Photo.find(params[:id])

      if current_user == @photo.user
        @photo.destroy

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", 8]]
SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = ?  ORDER BY "comments"."created_at" DESC  [["photo_id", 8]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (1)
---
    def comments
      @photo = Photo.find(params[:id])
      @comments = @photo.comments.includes(:user).order(created_at: :desc)

INSERT INTO "photos" ("image_file_name", "image_content_type", "image_file_size", "image_updated_at", "title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
      if params[:photo].nil?
        flash[:alert] = "Please upload a photo"
        redirect_to :back
      else
        @photo = current_user.photos.new(photo_params)
        if @photo.save