Code/app/controllers/photos_controller.rb

  def create
    @user = User.find(params[:user_id])
    if params[:photo].nil?
      flash[:alert] = "Please upload a photo"
      redirect_to :back
    else
      @photo = Photo.create(photo_params)
      @photo.user_id = @user.id
      @photo.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "photos" SET "user_id" = ?, "updated_at" = ? WHERE "photos"."id" = ?  [["user_id", 1], ["updated_at", "2024-10-31 13:46:58.093159"], ["id", 2]]