Code/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "password_salt", "password_hash", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    @user.valid?
    if !@user.is_email?
      flash[:alert] = "Input a properly formatted email."
      redirect_to :back
    elsif @user.errors.messages[:email] != nil
      flash[:notice] = "That email " + @user.errors.messages[:email].first
      redirect_to :back
    elsif @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "users".* FROM "users"
SELECT  "photos".* FROM "photos" WHERE "photos"."user_id" = ?  ORDER BY "photos"."created_at" DESC LIMIT 1  [["user_id", 2]]
---
  def show
    @user = User.find(params[:id])
    @tag = Tag.new
    @users = User.all
    @all_users = User.all
    @photos = (@user.photos + @user.followed_users.includes(:photos).flat_map(&:photos)).sort_by(&:created_at).reverse

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "follows" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 2], ["followed_id", 1], ["created_at", "2024-11-22 18:57:05.479975"], ["updated_at", "2024-11-22 18:57:05.479975"]]
---
  def follow
    user_to_follow = User.find(params[:id])
    if current_user.followed_users.include?(user_to_follow)
      flash[:alert] = "You are already following this user."
    else
      current_user.followed_users << user_to_follow

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def unfollow
    user_to_unfollow = User.find(params[:id])